# GetAssociatedZoneEquipment Method (Document, ISet(ElementId))

---
C#Visual BasicVisual C++
Revit 2024 API
---
ZoneEquipment..::..GetAssociatedZoneEquipment Method (Document, ISet<(Of <(<'ElementId>)>)>)
ZoneEquipment Class See Also
---
Gets the associated zone equipment of all specified analytical spaces.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020.1
# Syntax
C#
---
```text
public static ISet<ElementId> GetAssociatedZoneEquipment(
	Document document,
	ISet<ElementId> spaces
)
```

Visual Basic
---
```text
Public Shared Function GetAssociatedZoneEquipment ( _
	document As Document, _
	spaces As ISet(Of ElementId) _
) As ISet(Of ElementId)
```

Visual C++
---
```text
public:
static ISet<ElementId^>^ GetAssociatedZoneEquipment(
	Document^ document,
	ISet<ElementId^>^ spaces
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document where the analytical spaces and zone equipment exist.
spaces
    Type: System.Collections.Generic..::..ISet<(Of <(<'ElementId>)>)> The specified analytical spaces.
# ### Return Value
All associated zone equipment, either explicitly assigned or implicitly assigned via system-zone.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ZoneEquipment Class
GetAssociatedZoneEquipment Overload
Autodesk.Revit.DB.Mechanical Namespace